Конфигурация/src/Documents/СдачаВАренду/СдачаВАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СдачаВАренду</name>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.АвансыПокупателей</registerRecords>
  <registerRecords>AccumulationRegister.ЗадолженностьПокупателей</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>CatalogRef.Квартиры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаСутки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТабличнаяЧасть</name>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/Documents/СдачаВАренду/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦенаЗаСуткиПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	

	РассчитатьСуммуСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура КвартираПриИзменении(Элемент)
	
	Цена = ЦеныКвартирыВызовСервера.ЦенаКвартир(
		Объект.Квартира, Объект.Дата);
			
	Объект.ЦенаЗаСутки = Цена;
	
	РассчитатьСуммуСтроки();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки()
	Объект.Сумма = (Объект.ДатаОкончания - Объект.ДатаНачала)/24/60/60 * Объект.ЦенаЗаСутки;
КонецПроцедуры

#КонецОбласти
